---
kind: type
id: T:Autodesk.Revit.UI.TaskDialogIcon
source: html/6c3246ba-2a00-386e-1ec4-39cdb7ad664e.htm
---
# Autodesk.Revit.UI.TaskDialogIcon

Standard icons to be used in the task dialog.

## Syntax (C#)
```csharp
public enum TaskDialogIcon
```